<a href="https://colab.research.google.com/github/MagdaSousa/Estudo_Pandas/blob/master/ordenando_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'Col1':['A','A','B',np.nan,'D','C'],
                   'Col2':[2,1,8,7,4,3],
                   'Col3':[0,1,9,4,2,3]
                   })

In [4]:
df

  Col1  Col2  Col3
0    A     2     0
1    A     1     1
2    B     8     9
3  NaN     7     4
4    D     4     2
5    C     3     3

In [5]:
df.sort_values(by='Col1')# ordenando a coluna 1

  Col1  Col2  Col3
0    A     2     0
1    A     1     1
2    B     8     9
5    C     3     3
4    D     4     2
3  NaN     7     4

In [7]:
df.sort_values(by='Col1',ascending=False)

  Col1  Col2  Col3
4    D     4     2
5    C     3     3
2    B     8     9
0    A     2     0
1    A     1     1
3  NaN     7     4